# Working with data

In [18]:
# Print all the interactive output without resorting to print, not only the last result
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import numpy as np
import pandas as pd
from pandas import Series, DataFrame

import webbrowser
website = 'https://en.wikipedia.org/wiki/List_of_all-time_NFL_win%E2%80%93loss_records'
#data = pd.read_html(website, header =0, flavor = 'bs4')
data = pd.read_html(website, header =0)
nfl_frame = data[1]
nfl_frame = nfl_frame.head()
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,1336,737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,1370,749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [19]:
# Export to CSV
nfl_frame.to_csv('nfl_info.csv', sep=',', index=False)

In [20]:

import sys
nfl_frame.to_csv(sys.stdout, sep=',')

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,1336,737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,1370,749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.5589999999999999,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.5579999999999999,1960,AFC East

In [21]:
pd.read_csv('nfl_info.csv')

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,1336,737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,1370,749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East

In [23]:
#Limit number of rows

pd.read_csv('nfl_info.csv', nrows=3)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,1336,737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,1370,749,579,42,0.562,1920,NFC North

In [49]:
dframe = DataFrame(np.arange(9).reshape(3,3), index=['SF', 'LA', 'SD'], columns=['D1', 'D2', 'D3'])
dframe
dframe.to_csv('ex1.csv')

# Specify that 0 th col is the index column.
pd.read_csv('ex1.csv', index_col=0)

    D1  D2  D3
SF   0   1   2
LA   3   4   5
SD   6   7   8

    D1  D2  D3
SF   0   1   2
LA   3   4   5
SD   6   7   8

In [55]:
# Selectively write a column out
dframe.to_csv('ex2.csv', columns=['D2'])
pd.read_csv('ex2.csv', index_col=0)

    D2
SF   1
LA   4
SD   7

### Json object

In [120]:
json_obj = """
{
    "name":"John",
    "age":30,
    "cars": [
    {
        "car1":"Ford",
        "car2":"BMW",
        "car3":"Fiat"
    },
    {
        "car1":"Toyota",
        "car2":"Nissan",
        "car3":"Tesla"
    }
    ]
 }
"""

import json
data = json.loads(json_obj)
data

{'age': 30,
 'cars': [{'car1': 'Ford', 'car2': 'BMW', 'car3': 'Fiat'},
  {'car1': 'Toyota', 'car2': 'Nissan', 'car3': 'Tesla'}],
 'name': 'John'}

In [122]:
json.dumps(data)

'{"cars": [{"car2": "BMW", "car1": "Ford", "car3": "Fiat"}, {"car2": "Nissan", "car1": "Toyota", "car3": "Tesla"}], "age": 30, "name": "John"}'

In [123]:
DataFrame(data['cars'])

     car1    car2   car3
0    Ford     BMW   Fiat
1  Toyota  Nissan  Tesla

### HTML support

In [136]:
url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'
dframe_list = pd.read_html(url)
dframe = dframe_list[0]
dframe.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

### XLS file

In [140]:
xlsfile = pd.ExcelFile('Sample.xlsx')

In [141]:
dframe = xlsfile.parse('Sheet1')

In [143]:
dframe.head()

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,None,1618.5,3,20,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,None,1321.0,3,20,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,None,2178.0,3,15,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,None,888.0,3,15,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,None,2470.0,3,15,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014

### Data frame merge

In [174]:
from random import shuffle
df1 = DataFrame({'key':list('ZABCDEFZ'), 'values1':[10, 0, 1, 2, 3, 4, 5, 88]})
df2 = DataFrame({'key':list('ZABCSZ'), 'values2':[11, 0, 1, 3, 8, 89]})
df1
df2
print("Common items are merged :")
pd.merge(df1,df2) # Same as pd.merge(df1, df2, on='key')

  key  values1
0   Z       10
1   A        0
2   B        1
3   C        2
4   D        3
5   E        4
6   F        5
7   Z       88

  key  values2
0   Z       11
1   A        0
2   B        1
3   C        3
4   S        8
5   Z       89

Common items are merged :

  key  values1  values2
0   Z       10       11
1   Z       10       89
2   Z       88       11
3   Z       88       89
4   A        0        0
5   B        1        1
6   C        2        3

In [175]:
# Choose any data frame and choose whose key columns to use
pd.merge(df1, df2, on='key', how='left')

  key  values1  values2
0   Z       10     11.0
1   Z       10     89.0
2   A        0      0.0
3   B        1      1.0
4   C        2      3.0
5   D        3      NaN
6   E        4      NaN
7   F        5      NaN
8   Z       88     11.0
9   Z       88     89.0

In [177]:
# Choose any data frame and choose whose key columns to use
pd.merge(df1, df2, on='key', how='right')

  key  values1  values2
0   Z     10.0       11
1   Z     88.0       11
2   Z     10.0       89
3   Z     88.0       89
4   A      0.0        0
5   B      1.0        1
6   C      2.0        3
7   S      NaN        8

In [178]:
# Union of both the data frames
pd.merge(df1, df2, on='key', how='outer')

   key  values1  values2
0    Z     10.0     11.0
1    Z     10.0     89.0
2    Z     88.0     11.0
3    Z     88.0     89.0
4    A      0.0      0.0
5    B      1.0      1.0
6    C      2.0      3.0
7    D      3.0      NaN
8    E      4.0      NaN
9    F      5.0      NaN
10   S      NaN      8.0

In [180]:
# Another example
df3 = DataFrame({'key':list('XXXYZZ'), 'values1':np.arange(6)})
df4 = DataFrame({'key':list('YYXXZ'), 'values2':np.arange(5)})
df3
df4

  key  values1
0   X        0
1   X        1
2   X        2
3   Y        3
4   Z        4
5   Z        5

  key  values2
0   Y        0
1   Y        1
2   X        2
3   X        3
4   Z        4

In [185]:
pd.merge(df3, df4)

  key  values1  values2
0   X        0        2
1   X        0        3
2   X        1        2
3   X        1        3
4   X        2        2
5   X        2        3
6   Y        3        0
7   Y        3        1
8   Z        4        4
9   Z        5        4

### Merge data frame by keys

In [198]:
df_left = DataFrame({'key1' : ['Shaji', 'Roshni', 'Nida', 'Naina', 'Naina'], 
                     'key2' : [40, 37, 11, 3, 13],
                     'left_data' : ['good', 'good', 'bad', 'better', 'better']})
df_left
df_right = DataFrame({'key1' : ['Shaji', 'Shaji', 'Roshni', 'Nida', 'Naina', 'Naina'], 
                     'key2' : [40, 13, 11, 3, 44, 13],
                     'right_data' : ['good', 'bad', 'good', 'bad', 'better', 'better']})
df_right

     key1  key2 left_data
0   Shaji    40      good
1  Roshni    37      good
2    Nida    11       bad
3   Naina     3    better
4   Naina    13    better

     key1  key2 right_data
0   Shaji    40       good
1   Shaji    13        bad
2  Roshni    11       good
3    Nida     3        bad
4   Naina    44     better
5   Naina    13     better

In [201]:
# Merge by two keys
pd.merge(df_left, df_right, on=['key1', 'key2'], how='outer')

     key1  key2 left_data right_data
0   Shaji    40      good       good
1  Roshni    37      good        NaN
2    Nida    11       bad        NaN
3   Naina     3    better        NaN
4   Naina    13    better     better
5   Shaji    13       NaN        bad
6  Roshni    11       NaN       good
7    Nida     3       NaN        bad
8   Naina    44       NaN     better

In [204]:
# Merge by one key. The other keys are automatically suffixed
pd.merge(df_left, df_right, on=['key1'], how='outer')

     key1  key2_x left_data  key2_y right_data
0   Shaji      40      good      40       good
1   Shaji      40      good      13        bad
2  Roshni      37      good      11       good
3    Nida      11       bad       3        bad
4   Naina       3    better      44     better
5   Naina       3    better      13     better
6   Naina      13    better      44     better
7   Naina      13    better      13     better

In [207]:
# Merge by one key. The other keys are automatically suffixed, 
# Key suffixed explicitluy given.
pd.merge(df_left, df_right, on=['key1'], how='outer', suffixes=('__lefty', '__righty'))

     key1  key2__lefty left_data  key2__righty right_data
0   Shaji           40      good            40       good
1   Shaji           40      good            13        bad
2  Roshni           37      good            11       good
3    Nida           11       bad             3        bad
4   Naina            3    better            44     better
5   Naina            3    better            13     better
6   Naina           13    better            44     better
7   Naina           13    better            13     better

### Merge/Join data frame by index

In [211]:
df_left = DataFrame({'key1'  : ['X', 'Y', 'Z', 'X', 'Y'], 'data1' : range(5)})
df_right = DataFrame({'group_data' : [10, 11]}, index=['X', 'Y'])
df_left
df_right

   data1 key1
0      0    X
1      1    Y
2      2    Z
3      3    X
4      4    Y

   group_data
X          10
Y          11

In [217]:
# Merge left frame using key1 and right frame using index
pd.merge(df_left, df_right, left_on='key1', right_index=True)

   data1 key1  group_data
0      0    X          10
3      3    X          10
1      1    Y          11
4      4    Y          11

In [230]:
df_left = DataFrame({'key1' : ['SF', 'SF', 'SF', 'LA', 'LA'],
                     'key2' : [10,    20,   30,   20,   30],
                    'data_set' : np.arange(5)})
df_left

df_right = DataFrame(np.arange(10).reshape(5,2),
                     index=[['LA', 'LA', 'SF', 'SF', 'SF'], 
                            [20,    10,   10,   10,   20]], columns=['col_1', 'col_2'])

df_right

   data_set key1  key2
0         0   SF    10
1         1   SF    20
2         2   SF    30
3         3   LA    20
4         4   LA    30

       col_1  col_2
LA 20      0      1
   10      2      3
SF 10      4      5
   10      6      7
   20      8      9

In [232]:
# Merges data frames with hierarchical index
pd.merge(df_left, df_right, left_on=['key1', 'key2'], right_index=True)

   data_set key1  key2  col_1  col_2
0         0   SF    10      4      5
0         0   SF    10      6      7
1         1   SF    20      8      9
3         3   LA    20      0      1

In [238]:
df_left = DataFrame({'key1'  : ['X', 'Y', 'Z', 'X', 'Y'], 'data1' : range(5)})
df_right = DataFrame({'group_data' : [10, 11]}, index=['X', 'Y'])
df_left
df_right

# Default method of joining (MOSTLY using JOIN, use specific options in merge also as in join)

df_left.join(df_right)

   data1 key1
0      0    X
1      1    Y
2      2    Z
3      3    X
4      4    Y

   group_data
X          10
Y          11

   data1 key1  group_data
0      0    X         NaN
1      1    Y         NaN
2      2    Z         NaN
3      3    X         NaN
4      4    Y         NaN

### Concatinate Matrixes and data frames

In [244]:
m1 = np.arange(9).reshape(3,3)
m1
np.concatenate([m1,m1]) # same as np.concatenate([m1,m1], axis=0)
np.concatenate([m1,m1], axis=1)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [254]:
s1 = Series([1, 2, 3], index=['A', 'B', 'C'])
s1
s2 = Series([2, 3], index=['A', 'Q'])
s2
pd.concat([s1, s2])

# Hierarchically name series so that we can remembetr which one is which
pd.concat([s1, s2], keys=['s1_key', 's2_key'])

A    1
B    2
C    3
dtype: int64

A    2
Q    3
dtype: int64

A    1
B    2
C    3
A    2
Q    3
dtype: int64

s1_key  A    1
        B    2
        C    3
s2_key  A    2
        Q    3
dtype: int64

In [256]:
# Series is converetd to a data frame
pd.concat([s1, s2], axis=1, sort=False)

   s1_key  s2_key
A     1.0     2.0
B     2.0     NaN
C     3.0     NaN
Q     NaN     3.0

In [257]:
pd.concat([s1, s2], axis=1, sort=False, keys=['s1_key', 's2_key'])

   s1_key  s2_key
A     1.0     2.0
B     2.0     NaN
C     3.0     NaN
Q     NaN     3.0

In [264]:
df1 = DataFrame(np.random.randn(4,3), columns=['X', 'Y', 'Z'])
df2 = DataFrame(np.random.randn(3,3), columns=['Z', 'A', 'X'])
df1
df2
pd.concat([df1, df2], sort=False)

          X         Y         Z
0 -0.362017  2.777648 -0.436985
1  0.180660  0.623298  0.633216
2 -0.033518 -1.028464  0.514251
3 -0.002213 -0.119465  0.810524

          Z         A         X
0 -0.487977 -1.865589 -1.304093
1 -0.487250  1.142663 -0.660492
2 -0.558238  0.899295  0.200521

          X         Y         Z         A
0 -0.362017  2.777648 -0.436985       NaN
1  0.180660  0.623298  0.633216       NaN
2 -0.033518 -1.028464  0.514251       NaN
3 -0.002213 -0.119465  0.810524       NaN
0 -1.304093       NaN -0.487977 -1.865589
1 -0.660492       NaN -0.487250  1.142663
2  0.200521       NaN -0.558238  0.899295

In [266]:
# To fix indexing
pd.concat([df1, df2], sort=False, ignore_index=True)

          X         Y         Z         A
0 -0.362017  2.777648 -0.436985       NaN
1  0.180660  0.623298  0.633216       NaN
2 -0.033518 -1.028464  0.514251       NaN
3 -0.002213 -0.119465  0.810524       NaN
4 -1.304093       NaN -0.487977 -1.865589
5 -0.660492       NaN -0.487250  1.142663
6  0.200521       NaN -0.558238  0.899295